# ==============================================================================
# Brewfile.linux - Unified Linux Profile (Headless)
# ==============================================================================
# Full-featured headless environment for remote Linux hosts, servers, and homelabs.
# This profile merges former workstation(Linux) and server capabilities.
#
# This file contains INCREMENTAL packages beyond Brewfile.core.
# All core utilities (git, neovim, fzf, etc.) are inherited from core.
#
# Design Principle: Complete Dev + Ops Headless Stack
# Focus on:
#   1. Cloud-native development (K8s, containers, IaC)
#   2. AI-assisted workflows (aider, copilot-ready)
#   3. Security-first approach (hardware keys, encryption)
#   4. System monitoring and operations (glances, bmon, lnav)
#   5. SSH-only access (no GUI support)
#
# Profile: linux (headless)
# Dependencies: Brewfile.core
# Total Packages: 50 (47 from workstation + 3 from server)
# GUI Apps: None (removed in v2.0)
# ==============================================================================

tap "1password/tap"

# ------------------------------------------------------------------------------
# Enhanced Shell & CLI
# ------------------------------------------------------------------------------
brew "fastfetch"
brew "zellij"
brew "bottom"
brew "choose"

# ------------------------------------------------------------------------------
# System Monitoring & Operations (Server Additions)
# ------------------------------------------------------------------------------
brew "glances"    # Advanced system monitor (from server profile)
brew "bmon"       # Bandwidth monitor (from server profile)
brew "lnav"       # Log file navigator (from server profile)

# ------------------------------------------------------------------------------
# File Management & Previews
# ------------------------------------------------------------------------------
brew "yazi"
brew "watchexec"

# ------------------------------------------------------------------------------
# AI-Assisted Development
# ------------------------------------------------------------------------------
brew "aider"
brew "glow"
brew "vhs"

# ------------------------------------------------------------------------------
# Container & Kubernetes Ecosystem
# ------------------------------------------------------------------------------
brew "lazydocker"
brew "dive"
brew "k9s"
brew "helm"
brew "kubectx"
brew "stern"
brew "kustomize"

# ------------------------------------------------------------------------------
# Infrastructure as Code & DevOps
# ------------------------------------------------------------------------------
brew "terraform"
brew "ansible"
brew "trivy"
brew "grype"
brew "syft"

# ------------------------------------------------------------------------------
# Network & API Tools
# ------------------------------------------------------------------------------
brew "httpie"
brew "xh"
brew "doggo"
brew "gping"
brew "trippy"
brew "grpcurl"
brew "evans"

# ------------------------------------------------------------------------------
# Database Tools
# ------------------------------------------------------------------------------
brew "usql"
brew "pgcli"

# ------------------------------------------------------------------------------
# Runtime & Package Managers
# ------------------------------------------------------------------------------
brew "mise"
brew "uv"
brew "pnpm"

# ------------------------------------------------------------------------------
# Performance & Code Analysis
# ------------------------------------------------------------------------------
brew "hyperfine"
brew "tokei"
brew "bandwhich"

# ------------------------------------------------------------------------------
# Git Enhancements
# ------------------------------------------------------------------------------
brew "git-cliff"
brew "onefetch"

# ------------------------------------------------------------------------------
# Security & Encryption
# ------------------------------------------------------------------------------
brew "gnupg"
brew "age"
brew "ykman"
brew "1password-cli"
brew "gitleaks"

# ------------------------------------------------------------------------------
# Backup & System Maintenance
# ------------------------------------------------------------------------------
brew "restic"
