# ==============================================================================
# Brewfile.mini - Minimal Dev Container Profile
# ==============================================================================
# Lightweight, standalone configuration for ephemeral development environments.
# Designed for GitHub Codespaces, Dev Containers, DevBox, and Docker environments.
#
# This file is STANDALONE and does NOT inherit from Brewfile.core.
# Philosophy: "Just Enough to Write Code" - dev-ready minimal setup.
#
# Design Principle: Borrowed Trust, Fast Bootstrap
# Focus on:
#   1. Development runtimes (mise, uv, pnpm)
#   2. Essential editing tools (neovim, tmux)
#   3. Modern CLI replacements (bat, eza, ripgrep)
#   4. Git workflow (lazygit, delta)
#   5. Fast startup (< 5 minutes on fresh container)
#
# Profile: mini (ephemeral containers)
# Dependencies: None (standalone)
# Total Packages: ~30
# Excluded: Ops tools (k9s, lazydocker), Heavy monitoring, Infrastructure tools
# ==============================================================================

# ------------------------------------------------------------------------------
# Shell & Prompt
# ------------------------------------------------------------------------------
brew "zsh"
brew "starship"
brew "sheldon"

# ------------------------------------------------------------------------------
# Navigation & Search
# ------------------------------------------------------------------------------
brew "zoxide"
brew "fzf"

# ------------------------------------------------------------------------------
# Editor & Multiplexer
# ------------------------------------------------------------------------------
brew "neovim"
brew "tmux"

# ------------------------------------------------------------------------------
# Runtimes & Package Managers (CRITICAL for Development)
# ------------------------------------------------------------------------------
brew "mise"       # Universal version manager (replaces nvm, rbenv, pyenv)
brew "uv"         # Fast Python package manager
brew "pnpm"       # Fast, disk-efficient Node package manager

# ------------------------------------------------------------------------------
# Git & Version Control
# ------------------------------------------------------------------------------
brew "git"
brew "lazygit"
brew "git-delta"

# ------------------------------------------------------------------------------
# Modern CLI Replacements
# ------------------------------------------------------------------------------
brew "bat"        # Better cat
brew "eza"        # Better ls
brew "ripgrep"    # Better grep
brew "fd"         # Better find
brew "jq"         # JSON processor
brew "sd"         # Better sed

# ------------------------------------------------------------------------------
# Development Workflow
# ------------------------------------------------------------------------------
brew "direnv"     # Environment variable loader
brew "just"       # Command runner (like make but better)
brew "chezmoi"    # Dotfiles manager

# ------------------------------------------------------------------------------
# Network & HTTP
# ------------------------------------------------------------------------------
brew "curl"       # HTTP client (system fallback)

# ------------------------------------------------------------------------------
# Optional: Uncomment if needed in containers
# ------------------------------------------------------------------------------
# brew "gh"         # GitHub CLI (if using GitHub workflows in container)
