# ==============================================================================
# Brewfile.core - Essential Tools for ALL Environments
# ==============================================================================
# This file contains the minimal set of CLI tools required across all profiles.
# These are core utilities that every machine (macos/linux) needs.
# Note: 'mini' profile is standalone and does not inherit this file.
#
# Design Principle: Less is More
# Only include tools that are:
#   1. Used daily across all environments
#   2. Have no platform-specific alternatives
#   3. Are truly essential for basic shell workflow
#
# Profiles: macos | linux
# Dependencies: None (this is the foundation)
# ==============================================================================

# ------------------------------------------------------------------------------
# Shell & Prompt
# ------------------------------------------------------------------------------
brew "zsh"
brew "starship"
brew "sheldon"

# ------------------------------------------------------------------------------
# Navigation & Search
# ------------------------------------------------------------------------------
brew "zoxide"
brew "fzf"
brew "atuin"

# ------------------------------------------------------------------------------
# Modern Unix Replacements
# ------------------------------------------------------------------------------
brew "bat"
brew "eza"
brew "fd"
brew "ripgrep"
brew "sd"
brew "dust"
brew "duf"
brew "procs"
brew "btop"

# ------------------------------------------------------------------------------
# Text Processing & Data Tools
# ------------------------------------------------------------------------------
brew "jq"
brew "yq"
brew "miller"
brew "gron"
brew "tldr"

# ------------------------------------------------------------------------------
# Compression & Archives
# ------------------------------------------------------------------------------
brew "zstd"
brew "ouch"

# ------------------------------------------------------------------------------
# Version Control
# ------------------------------------------------------------------------------
brew "git"
brew "gh"
brew "lazygit"
brew "git-delta"

# ------------------------------------------------------------------------------
# Editor & Terminal Multiplexer
# ------------------------------------------------------------------------------
brew "neovim"
brew "tmux"

# ------------------------------------------------------------------------------
# Development Workflow
# ------------------------------------------------------------------------------
brew "direnv"
brew "just"
brew "lefthook"
brew "entr"

# ------------------------------------------------------------------------------
# Network Essentials
# ------------------------------------------------------------------------------
brew "curl"
brew "wget"

# ------------------------------------------------------------------------------
# System Maintenance
# ------------------------------------------------------------------------------
brew "chezmoi"
brew "topgrade"

# ------------------------------------------------------------------------------
# Runtime & Package Managers
# ------------------------------------------------------------------------------
brew "mise"        # Universal version manager (replaces asdf, nvm, pyenv)
brew "uv"          # Fast Python package manager
brew "pnpm"        # Efficient Node.js package manager

# ------------------------------------------------------------------------------
# Enhanced CLI Tools
# ------------------------------------------------------------------------------
brew "fastfetch"   # System information tool
brew "zellij"      # Modern terminal workspace
brew "bottom"      # System monitor
brew "choose"      # Better cut/awk for structured data

# ------------------------------------------------------------------------------
# File Management & Monitoring
# ------------------------------------------------------------------------------
brew "yazi"        # Terminal file manager
brew "watchexec"   # Execute commands on file changes

# ------------------------------------------------------------------------------
# AI-Assisted Development & Documentation
# ------------------------------------------------------------------------------
brew "aider"       # AI pair programming
brew "glow"        # Markdown renderer
brew "vhs"         # Terminal session recorder

# ------------------------------------------------------------------------------
# Network & API Tools
# ------------------------------------------------------------------------------
brew "httpie"      # Human-friendly HTTP client
brew "xh"          # Fast HTTP client (Rust)
brew "doggo"       # Modern DNS client
brew "gping"       # Ping with graph
brew "trippy"      # Network diagnostic tool
brew "grpcurl"     # gRPC curl
brew "evans"       # gRPC client

# ------------------------------------------------------------------------------
# Database Tools
# ------------------------------------------------------------------------------
brew "pgcli"       # PostgreSQL CLI with autocomplete

# ------------------------------------------------------------------------------
# Performance & Code Analysis
# ------------------------------------------------------------------------------
brew "hyperfine"   # Command-line benchmarking tool
brew "tokei"       # Code statistics
brew "bandwhich"   # Bandwidth monitor by process

# ------------------------------------------------------------------------------
# Git Enhancements
# ------------------------------------------------------------------------------
brew "git-cliff"   # Changelog generator
brew "onefetch"    # Git repository summary
brew "gitleaks"    # Secret scanner for git

# ------------------------------------------------------------------------------
# Security & Encryption
# ------------------------------------------------------------------------------
brew "age"         # Modern file encryption tool

# ------------------------------------------------------------------------------
# Backup & Disaster Recovery
# ------------------------------------------------------------------------------
brew "restic"      # Fast, secure backup program
