# Security & Identity
brew "gnupg"
brew "ykman"
brew "pinentry-mac"
cask "1password"

# Cloud & Sync
cask "localsend"
cask "nextcloud"

# Fonts
cask "font-jetbrains-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-noto-sans"
cask "font-source-han-serif-vf"

# Terminals
cask "ghostty"
cask "warp"

# Development & Editors
cask "visual-studio-code"
cask "dbeaver-community"
cask "coteditor"

# AI
cask "claude-code"
brew "gemini-cli"
cask "codex"

# Productivity
cask "raycast"
cask "snipaste"
cask "shottr"
cask "wpsoffice-cn"

# Notes & Writing
cask "obsidian"
cask "typora"

# Browsers
cask "google-chrome"
cask "firefox"

# System Utilities
cask "stats"
cask "keka"
cask "appcleaner"
cask "jordanbaird-ice"
cask "monitorcontrol"

# Media
cask "vlc"
cask "iina"
